
/** MySQL 练习 **/

/** 1. 创建 student 和 score 表 **/

-- 创建 student 表
-- 创建 score 表
-- 查询表

/** 2. 插入数据 **/

-- 给 student 插入数据
-- 给 score 插入数据

/** 3. 从student表查询所有学生的学号（id）、姓名（name）和院系（department）的信息 **/

/** 4. 从student表中查询计算机系和英语系的学生的信息 **/

/** 5. 从student表中查询年龄20~30岁的学生信息 **/

/** 6. 从student表中查询每个院系有多少人 **/

/** 7. 从score表中查询每个科目的最高分 **/

/** 8. 查询李四的考试科目（c_name）和考试成绩（grade）**/

/** 9. 用连接的方式查询所有学生的信息和考试信息 **/

/** 10. 计算每个学生的总成绩 **/

/** 11. 计算每个考试科目的平均成绩 **/
